local skillDict = {
    ["日轮"] = 3962,
    ["月轮"] = 3959,
    ["日斩"] = 3963,
    ["月斩"] = 3960,
    ["日破"] = 3967,
    ["月破"] = 3967,
    ["日劫"] = 3966,
    ["月劫"] = 3966,
    ["月悬"] = 34347,
    ["隐身"] = 3974,
    ["驱夜"] = 3979,
    ["诛邪"] = 22890,
    ["崇光"] = 37335,
    ["光明相"] = 3969,
    ["点掉诛邪"] = 0,
    ["正常隐身"] = 1,
    ["点掉崇光"] = 2,
    ["点掉魂日"] = 3,
};

local skillQueueQishou = {
    "日斩", "月斩", "月悬", "点掉崇光", "日劫", "隐身",
    "月破", "诛邪", "日破", "驱夜", "诛邪", "月破", "诛邪", "驱夜", "日破", "诛邪", "月破", "诛邪",
    "月斩", "日斩", "驱夜", "月破", "日劫", "诛邪", "月轮", "驱夜", "月破", "月斩", "日斩", "日破", "诛邪",
    "月斩", "崇光", "崇光", "崇光", "月破", "日斩", "驱夜", "日劫", "诛邪", "月斩", "月破",
    "日斩", "驱夜", "日破", "诛邪", "月轮", "月破",
};

local skillQueue2 = {
    "日斩", "月斩", "驱夜", "日斩", "月悬", "日劫", "崇光", "崇光", "崇光", "诛邪", "正常隐身",
    "月破", "诛邪", "日破", "驱夜", "诛邪", "月破", "诛邪", "崇光", "崇光", "崇光", "驱夜", "日劫", "月破", "诛邪",
    "日斩", "月斩", "驱夜", "月破", "日破", "诛邪", "月轮", "驱夜", "月破", "月斩", "日斩", "日破", "诛邪", "月斩", "月劫",
    "日斩", "驱夜", "日破", "月斩", "月破", "诛邪", "崇光", "崇光", "崇光",
    "日斩", "驱夜", "日破", "点掉魂日", "月轮", "月破",
};

local skillQueue3 = {
    "日斩", "月斩", "驱夜", "日斩", "月悬", "日劫", "崇光", "崇光", "崇光", "诛邪", "正常隐身",
    "月破", "诛邪", "日破", "驱夜", "诛邪", "月破", "诛邪", "崇光", "崇光", "崇光", "驱夜", "日劫", "月破", "诛邪",
    "日斩", "月斩", "驱夜", "月破", "日破", "诛邪", "月轮", "驱夜", "月破", "月斩", "日斩", "日破", "诛邪", "月斩", "月劫",
    "日斩", "驱夜", "日破", "月斩", "月破", "诛邪", "崇光", "崇光", "崇光",
    "日斩", "驱夜", "日破", "月轮", "月破", "诛邪",
};

local skillQueue1 = {
    "日斩", "月斩", "驱夜", "日斩", "月悬", "崇光", "崇光", "崇光", "日劫", "隐身",
    "月破", "诛邪", "日破", "驱夜", "诛邪", "月破", "诛邪", "驱夜", "日破", "诛邪", "月破", "诛邪",
    "月斩", "日斩", "驱夜", "月破", "日劫", "诛邪", "月轮", "驱夜", "月破", "月斩", "日斩", "日破", "诛邪",
    "月斩", "崇光", "崇光", "崇光", "月破", "日斩", "驱夜", "日劫", "诛邪", "月斩", "月破",
    "日斩", "驱夜", "日破", "诛邪", "月轮", "月破",
};

local skillQueueShouwei = {
    "日斩", "月斩", "驱夜", "日斩", "月悬", "崇光", "崇光", "崇光", "日劫", "隐身",
    "月破", "诛邪", "日破", "驱夜", "诛邪", "月破", "诛邪", "驱夜", "日破", "诛邪", "月破", "诛邪",
    "日斩", "崇光", "崇光", "崇光",
};

local i = 1;
local m = 0;

function Init()
    i = 1;
    m = 0;
end;

MacroNum = 1;

function Macro0(player)
    local sq;
    if m == 0 then
        sq = skillQueueQishou;
    elseif m == 1 then
        sq = skillQueue2;
    elseif m == 2 then
        sq = skillQueue3;
    elseif m == 3 then
        sq = skillQueue1;
    elseif m == 4 then
        sq = skillQueue2;
    elseif m == 5 then
        sq = skillQueue3;
    elseif m == 6 then
        sq = skillQueueShouwei;
    end;
    if skillDict[sq[i]] == 0 then -- 点掉诛邪
        player:buffDelMultiGroupByID(9909);
        i = i + 1;
    elseif skillDict[sq[i]] == 1 then -- 正常隐身
        player:cast(3974);
        i = i + 1;
    elseif skillDict[sq[i]] == 2 then -- 点掉崇光
        player:buffDelMultiGroupByID(28195);
        i = i + 1;
    elseif skillDict[sq[i]] == 3 then -- 点掉魂日
        player:buffDelMultiGroupByID(9910);
        i = i + 1;
    end;
    local id = skillDict[sq[i]];
    if player:cast(id) then
        i = i + 1; -- idx 此时为下一个技能的索引
        -- 处理下一个技能是隐身的情况
        if skillDict[sq[i]] == 3974 then
            player.delayCustom = 400;
        end;
        if i > #sq then
            i = 1;
            m = m + 1;
        end;
    end;
end;
